app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @friend=Friend.find(params[:id])

INSERT INTO "friends" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test1"], ["age", "12"], ["created_at", "2023-01-07 10:07:52.186313"], ["updated_at", "2023-01-07 10:07:52.186313"]]
---
  def create
    @friend=Friend.create(friend_params)

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @friend=Friend.find(params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "friends" SET "age" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["age", "29"], ["updated_at", "2023-01-07 10:21:38.662360"], ["id", 8]]
---
  def update
    @friend=Friend.find(params[:id])
    @friend.update(friend_params)

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 9]]
---
  def destroy
    @friend=Friend.find(params[:id])
    @friend.destroy